data/l1/apache/benchmark-apache.stock-4.17/cores-144/log/WRKwrk
Running 50s test @ http://127.0.0.1:8000/x.txt
  144 threads and 1152 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   445.29us    3.59ms 229.92ms   98.35%
    Req/Sec     6.44k     2.81k   17.56k    68.92%
  2543382 requests in 19.80s, 1.27GB read
  Socket errors: connect 1152, read 0, write 0, timeout 0
Requests/sec: 128427.16
Transfer/sec:     65.46MB